require ("UI命令")
功能设置arr = jsonLib.decode(动态.读取配置文件内容("功能设置配置.txt"))
登录及实况arr= jsonLib.decode(动态.读取配置文件内容("登录及实况配置.txt"))
使用说明arr= jsonLib.decode(动态.读取配置文件内容("使用说明配置.txt"))
PVParr = jsonLib.decode(动态.读取配置文件内容("PVP配置.txt"))
PVEarr = jsonLib.decode(动态.读取配置文件内容("PVE配置.txt"))
相似度arr = jsonLib.decode(动态.读取配置文件内容("相似度配置.txt"))
标题_1="^作者:青石       QQ:3416918055      群:624844984"
标题_2="*作者:青石       QQ:3416918055      群:624844984"
标题_3="~作者:青石       QQ:3416918055      群:624844984"
local 当前版本 = "0.2.8"
local 最新版本,公告
local ID = createHUD()
local function HUD(文字)
	showHUD(ID,文字,15,"0xffff0000","0xffffffff",2,0,0,0,0)
	sleep(2000)
	hideHUD(ID)
end

function 释放界面素材()
	extractAssets("斑驳青石.rc","sdcard/青石","*.jpg")
end

function 字符串转布尔(str)
	if type(str) == "string" then
		return str == "true" and true or false
	else
		return str
	end
end

function 下划线(标题,换行名称1,换行名称2)
	线id = 线id +1
	动态.换行({布局=标题,名称=换行名称1})
	动态.创建图像控件({布局=标题,名称="线-"..线id,文件名="下划线"})
	动态.换行({布局=标题,名称=换行名称2})
end

function 布局隐藏状态(标识,_start,_end,隐藏值) -- 输入布局3-5隐藏换行布局得 3-5
	for i=_start,_end do
		ui.setVisiblity(标识..i,隐藏值)
	end
end

释放界面素材()

运行 = false
关闭 =false

function 相似度设置界面()
	local 配置路径 = "sdcard/青石/相似度配置.txt"
	local 标题 = "相似度设置(单位/百分比)"
	动态.创建布局({名称 = 标题,大小={-2,-2},文字颜色="#FF22ffdb",背景="#ff112233"})
	function 相似度_保存()
		相似度arr = 动态.获取所有控件值()
		动态.保存配置文件("相似度配置.txt")
		动态.关闭布局(标题)
	end
	
	动态.创建文字框({布局=标题,名称="文字1-1",文本="辨别局内:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-局内相似度",文本="90",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-2",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-1"})
	动态.创建文字框({布局=标题,名称="文字1-3",文本="操作判断:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-操作判断相似度",文本="80",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-4",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-2"})
	动态.创建文字框({布局=标题,名称="文字1-5",文本="行动步骤:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-行动步骤相似度",文本="80",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-6",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-3"})
	动态.创建文字框({布局=标题,名称="文字1-7",文本="战斗步骤:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-战斗步骤相似度",文本="80",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-8",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-4"})
	动态.创建文字框({布局=标题,名称="文字1-9",文本="怪兽卡:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-怪兽卡相似度",文本="90",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-10",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-6"})
	动态.创建文字框({布局=标题,名称="文字1-11",文本="魔法卡:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-魔法卡相似度",文本="90",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-12",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-7"})
	动态.创建文字框({布局=标题,名称="文字1-13",文本="陷阱卡:",文字颜色="#FF22ffdb"})
	动态.创建输入框({布局=标题,名称="输入-陷阱卡相似度",文本="90",文字颜色="#FF22ffdb"})
	动态.创建文字框({布局=标题,名称="文字1-14",文本="%",文字颜色="#FF22ffdb"})
	
	动态.换行({布局=标题,名称="换行1-8"})
	动态.创建图像控件({布局=标题,名称="图像-相似度-保存",文件名="图像-保存",大小={-1,-1},事件="相似度_保存()"})
	
	
	动态.读取配置文件("相似度配置.txt")
	ui.show(标题,false)
end

function PVP自定义界面()
	local 配置路径 = "sdcard/青石/PVP配置.txt"
	local 标题 = "PVP步骤自定义"
	
	local 主要阶段内容 = {"空","精确.怪兽卡","精确.特招手牌怪兽卡","精确.覆盖怪兽卡","精确.发动手卡怪效果","精确.魔法卡",
	"精确.装备魔法卡","精确.场地魔法卡","精确.陷阱卡","基本.额外特招","基本.改守为攻","基本.发动在场魔陷效果","基本.发动在场怪效果",
	"基本.发动场地效果","基本.发动墓地效果","基本.发动技能"}
	
	local 战斗阶段内容={"空","默认攻击","直接攻击","智能攻击",
	"基本.发动在场魔陷效果","基本.发动在场怪效果","基本.发动墓地效果","基本.发动场地效果"}
	
	动态.创建布局({名称=标题,大小={-2,-2},文字颜色="#FF22ffdb",背景="#ff112233"})
	
	动态.创建文字框({布局=标题,名称="文字1-1",文本="↓主要阶段步骤↓",大小={-1,-1},文字颜色="#FFFF8040",背景="#3380FFFF"})
	动态.换行({布局=标题,名称="换行1-1"})
	
	动态.创建文字框({布局=标题,名称="文字1-2",文本="步骤/1:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动1",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-2"})
	
	动态.创建文字框({布局=标题,名称="文字1-3",文本="步骤/2:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动2",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-3"})
	
	动态.创建文字框({布局=标题,名称="文字1-4",文本="步骤/3:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动3",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-4"})
	
	动态.创建文字框({布局=标题,名称="文字1-5",文本="步骤/4:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动4",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-5"})
	
	动态.创建文字框({布局=标题,名称="文字1-6",文本="步骤/5:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动5",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-6"})
	
	动态.创建文字框({布局=标题,名称="文字1-7",文本="步骤/6:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动6",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-7"})
	
	动态.创建文字框({布局=标题,名称="文字1-8",文本="步骤/7:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动7",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-8"})
	
	动态.创建文字框({布局=标题,名称="文字1-9",文本="步骤/8:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动8",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-9"})
	
	动态.创建文字框({布局=标题,名称="文字2-1",文本="↓战斗阶段步骤↓",大小={-1,-1},文字颜色="#FFFF8040",背景="#3380FFFF"})
	动态.换行({布局=标题,名称="换行2-1"})
	
	动态.创建文字框({布局=标题,名称="文字2-2",文本="步骤/1:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗1",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-2"})
	
	动态.创建文字框({布局=标题,名称="文字2-3",文本="步骤/2:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗2",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-3"})
	
	动态.创建文字框({布局=标题,名称="文字2-4",文本="步骤/3:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗3",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-4"})
	
	动态.创建文字框({布局=标题,名称="文字2-5",文本="步骤/4:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗4",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-5"})
	
	保存 = function()
		PVParr = 动态.获取所有控件值()
		动态.保存配置文件("PVP配置.txt")
		动态.关闭布局(标题)
	end
	
	动态.创建图像控件({布局=标题,名称="图像-保存",文件名="图像-保存",大小={-1,-1},事件="保存()"})
	动态.读取配置文件("PVP配置.txt")
	ui.show(标题,false)
end


function PVE自定义界面()
	local 配置路径 = "sdcard/青石/PVE配置.txt"
	local 标题 = "PVE步骤自定义"
	
	local 主要阶段内容 = {"空","精确.怪兽卡","精确.特招手牌怪兽卡","精确.覆盖怪兽卡","精确.发动手卡怪效果","精确.魔法卡",
	"精确.装备魔法卡","精确.场地魔法卡","精确.陷阱卡","基本.额外特招","基本.改守为攻","基本.发动在场魔陷效果","基本.发动在场怪效果",
	"基本.发动场地效果","基本.发动墓地效果","基本.发动技能"}
	
	local 战斗阶段内容={"空","默认攻击","直接攻击","智能攻击",
	"基本.发动在场魔陷效果","基本.发动在场怪效果","基本.发动墓地效果","基本.发动场地效果"}
	
	动态.创建布局({名称=标题,大小={-2,-2},文字颜色="#FF22ffdb",背景="#ff112233"})
	
	动态.创建文字框({布局=标题,名称="文字1-1",文本="↓主要阶段步骤↓",大小={-1,-1},文字颜色="#FFFF8040",背景="#3380FFFF"})
	动态.换行({布局=标题,名称="换行1-1"})
	
	动态.创建文字框({布局=标题,名称="文字1-2",文本="步骤/1:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动1",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-2"})
	
	动态.创建文字框({布局=标题,名称="文字1-3",文本="步骤/2:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动2",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-3"})
	
	动态.创建文字框({布局=标题,名称="文字1-4",文本="步骤/3:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动3",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-4"})
	
	动态.创建文字框({布局=标题,名称="文字1-5",文本="步骤/4:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动4",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-5"})
	
	动态.创建文字框({布局=标题,名称="文字1-6",文本="步骤/5:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动5",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-6"})
	
	动态.创建文字框({布局=标题,名称="文字1-7",文本="步骤/6:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动6",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-7"})
	
	动态.创建文字框({布局=标题,名称="文字1-8",文本="步骤/7:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动7",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-8"})
	
	动态.创建文字框({布局=标题,名称="文字1-9",文本="步骤/8:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="行动8",内容=主要阶段内容})
	动态.换行({布局=标题,名称="换行1-9"})
	
	动态.创建文字框({布局=标题,名称="文字2-1",文本="↓战斗阶段步骤↓",大小={-1,-1},文字颜色="#FFFF8040",背景="#3380FFFF"})
	动态.换行({布局=标题,名称="换行2-1"})
	
	动态.创建文字框({布局=标题,名称="文字2-2",文本="步骤/1:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗1",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-2"})
	
	动态.创建文字框({布局=标题,名称="文字2-3",文本="步骤/2:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗2",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-3"})
	
	动态.创建文字框({布局=标题,名称="文字2-4",文本="步骤/3:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗3",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-4"})
	
	动态.创建文字框({布局=标题,名称="文字2-5",文本="步骤/4:",文字颜色="#FFDDFE78b"})
	动态.创建下拉框({布局=标题,名称="战斗4",内容=战斗阶段内容})
	动态.换行({布局=标题,名称="换行2-5"})
	
	保存 = function()
		PVEarr = 动态.获取所有控件值()
		动态.保存配置文件("PVE配置.txt")
		动态.关闭布局(标题)
	end
	
	动态.创建图像控件({布局=标题,名称="图像-保存",文件名="图像-保存",大小={-1,-1},事件="保存()"})
	
	动态.读取配置文件("PVE配置.txt")
	ui.show(标题,false)
end


function 功能设置界面()
	
	local 配置路径 = "sdcard/青石/功能设置配置.txt"
	
	动态.创建布局({名称=标题_1,大小={-1,-1},文字颜色="#FF22ffdb",背景="#ff112233"})
	
	动态.创建图像控件({布局=标题_1,名称="左标签",文件名="左-1"})
	function 中标签事件1()
		功能设置arr = 动态.获取所有控件值()
		动态.保存配置文件("功能设置配置.txt")
		动态.关闭布局(标题_1)
		登录及实况界面()
	end
	动态.创建图像控件({布局=标题_1,名称="中标签",事件="中标签事件1()",文件名="中-0"})
	function 右标签事件1()
		功能设置arr = 动态.获取所有控件值()
		动态.保存配置文件("功能设置配置.txt")
		动态.关闭布局(标题_1)
		使用说明界面()
	end
	动态.创建图像控件({布局=标题_1,名称="右标签",事件="右标签事件1()",文件名="右-0"})
	
	--执行顺序输入框
	动态.换行({布局=标题_1,名称="换行-1"})
	动态.创建文字框({布局=标题_1,名称="文本框-1",文本="*任务:",文字颜色="#FFFF0000"})
	动态.创建输入框({布局=标题_1,名称="输入-任务",文本="",文字颜色="#FF80FFFF",全宽=true})
	动态.换行({布局=标题_1,名称="换行-2"})
	动态.创建文字框({布局=标题_1,名称="文字-提示",文本="例:1-20,2-30,3-40,4-50(传送门20次,活动30次,休闲40次,排名50次)",文字颜色="#FFFFFF2D"})
	动态.换行({布局=标题_1,名称="换行-3"})
	-- 门设置按钮
	
	local 文字颜色= "#FF22ffdb"
	动态.换行({布局=标题_1})
	function click_门_0()
		动态.重设图像控件({名称="图像-门",文件名="图像-门设置-1",事件="click_门_1()"})
		布局隐藏状态("换行1-",2,7,0)
	end
	function click_门_1()
		动态.重设图像控件({名称="图像-门",文件名="图像-门设置-0",事件="click_门_0()"})
		布局隐藏状态("换行1-",2,7,3)
	end
	
	动态.创建图像控件({布局=标题_1,名称="图像-门",文件名="图像-门设置-0",事件="click_门_0()"})
	--隐藏的控件
	动态.换行({布局=标题_1,名称="换行1-2"})
	动态.创建多选框({布局=标题_1,名称="多选-是否翻页",文本="是否翻页",选项=false,文字颜色="#FF22ffdb"})
	动态.创建多选框({布局=标题_1,名称="多选-门mod",文本="MOD解锁AI模式(进群下载MOD版本)",选项=false,文字颜色="#FF22ffdb"})
	下划线(标题_1,"换行1-3","换行1-4")
	
	动态.创建文字框({布局=标题_1,名称="文字-2",文本="奖励倍数: ",文字颜色="#FF22ffdb"})
	动态.创建单选框({布局=标题_1,名称="单选-门倍数",内容={"1倍","2倍","3倍"},默认选项=2,大小={-2,-2},横向=true})
	下划线(标题_1,"换行1-5","换行1-6")
	
	动态.创建文字框({布局=标题_1,名称="文字-3",文本="NPC等级: ",文字颜色="#FF22ffdb"})
	动态.创建单选框({布局=标题_1,名称="单选-门等级",内容={"10级","20级","30级","40级"},默认选项=0,大小={-2,-2},横向=true})
	下划线(标题_1,"换行1-7","换行1-8")
	布局隐藏状态("换行1-",2,7,3)
	--以上为门设置按钮的响应控件
	
	--路人设置按钮
	function click_路人_0()
		动态.重设图像控件({名称="图像-路人",文件名="图像-路人设置-1",事件="click_路人_1()"})
		布局隐藏状态("换行2-",1,4,0)
	end
	function click_路人_1()
		动态.重设图像控件({名称="图像-路人",文件名="图像-路人设置-0",事件="click_路人_0()"})
		布局隐藏状态("换行2-",1,4,3)
	end
	动态.创建图像控件({布局=标题_1,名称="图像-路人",文件名="图像-路人设置-0",事件="click_路人_0()"})
	动态.换行({布局=标题_1,名称="换行2-1"})
	动态.创建多选框({布局=标题_1,名称="多选-路人开关",文本="路人开关   定时(单位/小时):",选中=true,文字颜色=文字颜色})
	动态.创建输入框({布局=标题_1,名称="输入-清路时间",文本="3",文字颜色="#FF8080FF"})
	下划线(标题_1,"换行2-2","换行2-3")
	
	动态.创建多选框({布局=标题_1,名称="多选-决斗珠开关",文本="使用决斗珠  次数:",文字颜色=文字颜色})
	动态.创建输入框({布局=标题_1,名称="输入-决斗珠次数",文本="10",文字颜色=文字颜色})
	下划线(标题_1,"换行2-4","换行2-5")
	
	
	布局隐藏状态("换行2-",1,4,3)
	--以上为路人设置按钮的响应控件
	
	--活动设置按钮
	function click_活动_0()
		动态.重设图像控件({名称="图像-活动",文件名="图像-活动设置-1",事件="click_活动_1()"})
		布局隐藏状态("换行3-",1,2,0)
		布局隐藏状态("换行3-",7,7,0)
		布局隐藏状态("换行3-",5,5,0)
	end
	function click_活动_1()
		动态.重设图像控件({名称="图像-活动",文件名="图像-活动设置-0",事件="click_活动_0()"})
		布局隐藏状态("换行3-",1,7,3)
		动态.设置({名称="文字-骰子活动",文字颜色="#FFFF8040",事件="骰子活动设置_0()"})
		动态.设置({名称="文字-组队锦标赛",文字颜色="#FFFF8040",事件="组队锦标赛设置_0()"})
	end
	动态.创建图像控件({布局=标题_1,名称="图像-活动",文件名="图像-活动设置-0",事件="click_活动_0()"})
	动态.换行({布局=标题_1,名称="换行3-1"})
	
	动态.创建文字框({布局=标题_1,名称="文字3-1",文本="选择挂机活动序号: ",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-活动",内容={"1","2","3"}})
	动态.换行({布局=标题_1,名称="换行3-2"})
	
	function 骰子活动设置_0()
		动态.设置({名称="文字-骰子活动",文字颜色="#FFFF0000",事件="骰子活动设置_1()"})
		布局隐藏状态("换行3-",3,4,0)
	end
	function 骰子活动设置_1()
		动态.设置({名称="文字-骰子活动",文字颜色="#FFFF8040",事件="骰子活动设置_0()"})
		布局隐藏状态("换行3-",3,4,3)
	end
	
	动态.创建文字框({事件="骰子活动设置_0()",布局=标题_1,名称="文字-骰子活动",文本=" 1.骰 子 活 动 设 置",文字颜色="#FFFF8040",背景="#3380FFFF",文字大小=15,大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行3-3"})
	动态.创建多选框({布局=标题_1,名称="多选-骰子-是否使用物品",文本="使用物品",文字颜色=文字颜色,初始选项=false})
	
	下划线(标题_1,"换行3-4","换行3-5")
	
	function 组队锦标赛设置_0()
		动态.设置({名称="文字-组队锦标",文字颜色="#FFFF0000",事件="组队锦标赛设置_1()"})
		布局隐藏状态("换行3-",6,6,0)
	end
	function 组队锦标赛设置_1()
		动态.设置({名称="文字-组队锦标",文字颜色="#FFFF8040",事件="组队锦标赛设置_0()"})
		布局隐藏状态("换行3-",6,6,3)
	end
	动态.创建文字框({事件="组队锦标赛设置_0()",布局=标题_1,名称="文字-组队锦标赛",文本=" 2.组 队 锦 标 赛 设 置",文字颜色="#FFFF8040",背景="#3380FFFF",文字大小=15,大小={-1,-1}})
	
	动态.换行({布局=标题_1,名称="换行3-6"})
	动态.创建文字框({布局=标题_1,名称="文字-选择赛种",文本="请选择赛种: ",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-赛种",内容={"一直选择最高赛种","DM","GX","5D~S","ZEXAL","ARC-V"}})
	动态.换行({布局=标题_1,名称="换行3-7"})
	动态.创建文字框({布局=标题_1,名称="文字-RA活动",文本=" 3.RAID DUEL",文字颜色="#FFFF8040",背景="#3380FFFF",文字大小=15,大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行3-8"})
	布局隐藏状态("换行3-",1,7,3)
	--以上为活动设置按钮的响应事件
	
	--对局设置按钮
	function click_对局设置_0()
		动态.重设图像控件({名称="图像-对局设置",文件名="图像-对局设置-1",事件="click_对局设置_1()"})
		布局隐藏状态("对局其他-",1,1,0)
		布局隐藏状态("卡组设置-",1,1,0)
	end
	function click_对局设置_1()
		动态.重设图像控件({名称="图像-对局设置",文件名="图像-对局设置-0",事件="click_对局设置_0()"})
		布局隐藏状态("换行4-",1,25,3)
		布局隐藏状态("对局其他-",1,1,3)
		布局隐藏状态("卡组设置-",1,1,3)
		动态.设置({名称="文字-卡组设置",文字颜色="#FFFF8040",事件="click_卡组设置_0()"})
		动态.设置({名称="文字-对局其他",文字颜色="#FFFF8040",事件="click_对局其他_0()"})
	end
	动态.创建图像控件({布局=标题_1,名称="图像-对局设置",文件名="图像-对局设置-0",事件="click_对局设置_0()"})
	动态.换行({布局=标题_1,名称="卡组设置-1"})
	
	function click_卡组设置_0()
		动态.设置({名称="文字-卡组设置",文字颜色="#FFFF0000",事件="click_卡组设置_1()"})
		布局隐藏状态("换行4-",2,7,0)
	end
	function click_卡组设置_1()
		动态.设置({名称="文字-卡组设置",文字颜色="#FFFF8040",事件="click_卡组设置_0()"})
		布局隐藏状态("换行4-",2,7,3)
	end
	动态.创建文字框({事件="click_卡组设置_0()",布局=标题_1,名称="文字-卡组设置",文本=" 卡 组 设 置 - 点击",文字颜色="#FFFF8040",背景="#3380FFFF",文字大小=15,大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行4-2"})
	
	动态.创建文字框({布局=标题_1,名称="文字-PVP卡组",文本="PVP:",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-PVP卡组",内容={"默认","白给","真红眼(开发中)","白龙","六武众(开发中)","盖亚","自定义操作步骤"}})
	动态.创建文字框({布局=标题_1,名称="文字-PVE卡组",文本="PVE:",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-PVE卡组",内容={"默认","真红眼(开发中)","白龙","六武众(开发中)","盖亚","自定义操作步骤"}})
	动态.换行({布局=标题_1,名称="换行4-3"})
	
	function PVP自定义()
		PVP自定义界面()
	end
	function PVE自定义()
		PVE自定义界面()
	end
	
	动态.创建文字框({布局=标题_1,名称="文字4-空格-2",文本="      "})
	动态.创建图像控件({布局=标题_1,名称="图像-PVP自定义",文件名="图像-PVP自定义",事件="PVP自定义()"})
	动态.创建文字框({布局=标题_1,名称="文字4-空格",文本="         "})
	动态.创建图像控件({布局=标题_1,名称="图像-PVE自定义",文件名="图像-PVE自定义",事件="PVE自定义()"})
	
	下划线(标题_1,"换行4-4","换行4-5")
	动态.创建文字框({布局=标题_1,名称="文字-白龙-1",文本="     白 龙 设 置",文字颜色="#FF3260FE",背景="#3380FFFF",文字大小=15,大小={-1,-1}})
	
	动态.换行({布局=标题_1,名称="换行4-6"})
	动态.创建多选框({布局=标题_1,名称="多选-白龙-通召",文本="卡组是否携带其他怪兽卡",文字颜色=文字颜色})
	
	function click_对局其他_0()
		动态.设置({名称="文字-对局其他",文字颜色="#FFFF0000",事件="click_对局其他_1()"})
		布局隐藏状态("换行4-",8,25,0)
	end
	function click_对局其他_1()
		动态.设置({名称="文字-对局其他",文字颜色="#FFFF8040",事件="click_对局其他_0()"})
		布局隐藏状态("换行4-",8,25,3)
	end
	动态.换行({布局=标题_1,名称="换行4-7"})
	动态.换行({布局=标题_1,名称="对局其他-1"})
	动态.创建文字框({事件="click_对局其他_0()",布局=标题_1,名称="文字-对局其他",文本="   其 他 设 置 - 点击",文字颜色="#FFFF8040",背景="#3380FFFF",文字大小=15,大小={-1,-1}})
	
	动态.换行({布局=标题_1,名称="换行4-8"})
	
	动态.创建多选框({布局=标题_1,名称="多选-覆盖速攻",文本="覆盖速攻魔法",文字颜色=文字颜色,选中=false})
	动态.创建多选框({布局=标题_1,名称="多选-改守为攻",文本="改守为攻",文字颜色=文字颜色,选中=false})
	动态.创建多选框({布局=标题_1,名称="多选-额外特招",文本="特招(同调/超量)",文字颜色=文字颜色,选中=false})
	动态.换行({布局=标题_1,名称="换行4-9"})
	动态.创建文字框({布局=标题_1,名称="文字-攻击方式",文本="攻击方式 : ",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-攻击方式",内容={"默认攻击","直接攻击","智能攻击"},默认选项=0})
	动态.换行({布局=标题_1,名称="换行4-10"})
	
	动态.创建文字框({布局=标题_1,名称="文字-以上无效",文本="使用自定义步骤以上4个选项无效",文字颜色="#FFFF0000"})
	动态.换行({布局=标题_1,名称="换行4-11"})
	
	动态.创建多选框({布局=标题_1,名称="多选-装备判定",文本="我方没有攻表怪兽不使用装备魔法",文字颜色=文字颜色,选中=false})
	动态.换行({布局=标题_1,名称="换行4-12"})
	
	动态.创建多选框({布局=标题_1,名称="多选-人物技能",文本="使用人物技能",文字颜色=文字颜色,选中=false})
	动态.创建多选框({布局=标题_1,名称="多选-识别镜宫",文本="检测镜宫",文字颜色=文字颜色,选中=false})
	动态.换行({布局=标题_1,名称="换行4-13"})
	
	动态.创建多选框({布局=标题_1,名称="多选-0攻改守",文本="0攻击力怪兽改守备表示",文字颜色=文字颜色,选中=false})
	动态.换行({布局=标题_1,名称="换行4-14"})
	
	动态.创建文字框({布局=标题_1,名称="文字-效果发动2",文本=" 主 动 发 动 效 果 ",文字颜色="#FFFF8040",背景="#5580FFFF",大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行4-15"})
	
	动态.创建多选框({布局=标题_1,名称="多选-墓地效果",文本="墓地",文字颜色=文字颜色,选中=false})
	动态.创建多选框({布局=标题_1,名称="多选-场地效果",文本="场地",文字颜色=文字颜色,选中=false})
	动态.创建多选框({布局=标题_1,名称="多选-怪兽效果",文本="怪兽(在场)",文字颜色=文字颜色,选中=false})
	动态.创建多选框({布局=标题_1,名称="多选-魔陷效果",文本="魔陷(在场)",文字颜色=文字颜色,选中=false})
	动态.换行({布局=标题_1,名称="换行4-16"})
	
	动态.创建文字框({布局=标题_1,名称="文字-坑效条件-1",文本=" 发 动 坑 效 条 件",文字颜色="#FFFF8040",背景="#5580FFFF",大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行4-17"})
	
	动态.创建多选框({布局=标题_1,名称="多选-坑效条件-1",文本="敌方回合",文字颜色=文字颜色})
	动态.创建多选框({布局=标题_1,名称="多选-坑效条件-2",文本="敌方存在怪兽",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行4-20"})
	
	动态.创建文字框({布局=标题_1,名称="文字-发动怪效条件-1",文本=" 发 动 在 场 怪 效 条 件",文字颜色="#FFFF8040",背景="#5580FFFF",大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行4-21"})
	
	动态.创建多选框({布局=标题_1,名称="多选-怪效条件-1",文本="敌方存在怪兽",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行4-22"})
	
	动态.创建文字框({布局=标题_1,名称="文字-发动魔陷效条件-1",文本=" 发 动 在 场 魔 陷 条 件 ",文字颜色="#FFFF8040",背景="#5580FFFF",大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行4-23"})
	动态.创建多选框({布局=标题_1,名称="多选-魔陷效条件-1",文本="敌方存在怪兽",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行4-24"})
	
	动态.创建文字框({布局=标题_1,名称="文字-速攻发动条件-1",文本=" 速 攻 魔 法 直 发 条 件 (手牌):",文字颜色="#FFFF8040",背景="#5580FFFF",大小={-1,-1}})
	动态.换行({布局=标题_1,名称="换行4-25"})
	动态.创建多选框({布局=标题_1,名称="多选-速攻发动条件-1",文本="敌方存在怪兽",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行4-26"})
	
	布局隐藏状态("换行4-",8,25,3)
	--隐藏选项文字框
	布局隐藏状态("对局其他-",1,1,3)
	布局隐藏状态("卡组设置-",1,1,3)
	布局隐藏状态("换行4-",1,7,3)
	
	--以上是对局设置
	
	
	
	
	function click_全局设置_0()
		动态.重设图像控件({布局=标题_1,名称="图像-全局设置",文件名="图像-全局设置-1",事件="click_全局设置_1()"})
		布局隐藏状态("换行5-",1,9,0)
	end
	function click_全局设置_1()
		动态.重设图像控件({布局=标题_1,名称="图像-全局设置",文件名="图像-全局设置-0",事件="click_全局设置_0()"})
		布局隐藏状态("换行5-",1,9,3)
	end
	动态.创建图像控件({布局=标题_1,名称="图像-全局设置",文件名="图像-全局设置-0",事件="click_全局设置_0()"})
	动态.换行({布局=标题_1,名称="换行5-1"})
	
	动态.创建文字框({布局=标题_1,名称="文字5-1",文本="任务运行完后: ",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-任务完成选项",内容={"继续循环任务","死循环刷路人","关闭游戏及脚本"}})
	动态.换行({布局=标题_1,名称="换行5-2"})
	
	动态.创建文字框({布局=标题_1,名称="文字-选择礼物",文本="选择礼物: ",文字颜色=文字颜色})
	动态.创建下拉框({布局=标题_1,名称="下拉-选择礼物",内容={"1","2","3"}})
	动态.换行({布局=标题_1,名称="换行5-3"})
	
	动态.创建多选框({布局=标题_1,名称="多选-礼盒-双升",文本="礼盒是否双倍领取",选中=true,文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行5-4"})
	
	动态.创建多选框({布局=标题_1,名称="多选-角色开关",文本="角色达到",文字颜色=文字颜色})
	动态.创建输入框({布局=标题_1,名称="输入-角色切换等级",文本="39",文字颜色="#FFFF8040"})
	动态.创建文字框({布局=标题_1,名称="文字-切换角色",文本="级切换角色",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行5-5"})
	
	动态.创建多选框({布局=标题_1,名称="多选-当前门开关",文本="角色超过设定等级不刷传送门",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行5-6"})
	
	动态.创建多选框({布局=标题_1,名称="多选-防卡死开关"})
	动态.创建输入框({布局=标题_1,名称="输入-卡死判定时间",文本="10",文字颜色="#FFFF8040"})
	动态.创建文字框({布局=标题_1,名称="文字-卡死判定",文本="分钟没完成任何对局重启游戏",文字颜色=文字颜色})
	动态.换行({布局=标题_1,名称="换行5-7"})
	
	动态.创建文字框({布局=标题_1,名称="文字5-2",文本="掉线操作选择: ",文字颜色=文字颜色})
	动态.创建单选框({布局=标题_1,名称="单选-掉线选择",内容={"重试","重启"},初始选项=0,大小={-2,-2},横向=true})
	动态.换行({布局=标题_1,名称="换行5-8"})
	
	function 相似度设置()
		相似度设置界面()
	end
	
	动态.创建图像控件({布局=标题_1,名称="图像-相似度",文件名="图像-相似度设置",事件="相似度设置()"})
	下划线(标题_1,"换行5-9","换行5-10")
	布局隐藏状态("换行5-",1,9,3)
	
	--以上为对局设置的响应控件
	
	--脚本启动和关闭按钮
	function click_运行()
		功能设置arr = 动态.获取所有控件值()
		动态.保存配置文件("功能设置配置.txt")
		ui.dismiss(标题_1)
		sleep(500)
		运行= true
	end
	动态.创建图像控件({事件="click_运行()",布局=标题_1,名称="图像-运行脚本",文件名="图像-运行脚本"})
	function click_关闭()
		功能设置arr = 动态.获取所有控件值()
		动态.保存配置文件("功能设置配置.txt")
		ui.dismiss(标题_1)
		sleep(500)
		exitScript()
	end
	动态.创建文字框({布局=标题_1,名称="空白格",文本="                                 "})
	动态.创建图像控件({事件="click_关闭()",布局=标题_1,名称="图像-关闭脚本",文件名="图像-退出脚本"})
	
	动态.读取配置文件("功能设置配置.txt")
	运行 = false
	关闭 = false
	ui.show(标题_1, false)

	-- 默认 2 分钟后自动点运行按钮
	local time = tickCount()
	while (true) do
		if (tickCount() - time) > (2 * 60 * 1000) then
			click_运行()
			break
		end
		sleep(1000)
	end
end

function 登录及实况界面()
	local 配置路径 ="sdcard/青石/登录及实况配置.txt"
	local 文字颜色= "#FF22ffdb"
	local 输入字颜色="#ffFDB20F"
	local 文字背景="#3380FFFF"
	local 文字框文字颜色="#FFFF8040"
	动态.创建布局({名称=标题_2,大小={720,-1},文字颜色="#FF22ffdb",背景="#ff112233"})
	
	function 左标签事件2()
		登录及实况arr = 动态.获取所有控件值()
		动态.保存配置文件("登录及实况配置.txt")
		动态.关闭布局(标题_2)
		功能设置界面()
		
	end
	动态.创建图像控件({布局=标题_2,名称="左标签",事件="左标签事件2()",文件名="左-0"})
	动态.创建图像控件({布局=标题_2,名称="中标签",文件名="中-1"})
	function 右标签事件2()
		登录及实况arr = 动态.获取所有控件值()
		动态.保存配置文件("登录及实况配置.txt")
		动态.关闭布局(标题_2)
		使用说明界面()
	end
	动态.创建图像控件({布局=标题_2,名称="右标签",事件="右标签事件2()",文件名="右-0"})
	动态.换行({布局=标题_2,名称="换行-1"})
	
	动态.创建文字框({布局=标题_2,名称="文字-登录方式",文本="*登录方式",文字颜色="#FFFF0000",背景=文字背景,全宽=true,文字大小=20})
	动态.换行({布局=标题_2,名称="换行-3"})
	动态.创建单选框({布局=标题_2,名称="单选-登录方式",内容={"试用","卡密"},默认选项=0,大小={-1,-1},横向=true})
	动态.换行({布局=标题_2,名称="换行-2"})
	动态.创建文字框({布局=标题_2,名称="文字-卡密",文本="卡密 :",文字颜色=文字颜色})
	动态.创建输入框({布局=标题_2,名称="输入-卡密",文字颜色=输入字颜色,全宽=true})
	动态.换行({布局=标题_2,名称="换行-4"})
	
	动态.创建文字框({布局=标题_2,名称="文字-挂机实况",文本="挂机实况",文字颜色=文字框文字颜色,背景=文字背景,全宽=true,文字大小=20})
	动态.换行({布局=标题_2,名称="换行-5"})
	
	
	动态.读取配置文件("登录及实况配置.txt")
	ui.show(标题_2,false)
end

function 使用说明界面()
	local 配置路径 ="sdcard/青石/使用说明配置.txt"
	动态.创建布局({名称=标题_3,大小={720,-1},文字颜色="#FF22ffdb",背景="#ff112233"})
	
	function 左标签事件3()
		使用说明arr = 动态.获取所有控件值()
		动态.保存配置文件("使用说明配置.txt")
		动态.关闭布局(标题_3)
		功能设置界面()
		
	end
	动态.创建图像控件({布局=标题_3,名称="左标签",事件="左标签事件3()",文件名="左-0"})
	function 中标签事件3()
		使用说明arr = 动态.获取所有控件值()
		动态.保存配置文件("使用说明配置.txt")
		动态.关闭布局(标题_3)
		登录及实况界面()
	end
	动态.创建图像控件({布局=标题_3,名称="中标签",事件="中标签事件3()",文件名="中-0"})
	动态.创建图像控件({布局=标题_3,名称="右标签",文件名="右-1"})
	
	动态.读取配置文件("功能设置配置.txt")
	ui.show(标题_3,false)
end

function 提示更新()
	local 文字颜色 = "#FF22ffdb"
	local 标题 = "===更新提示==="
	if 0 == downloadFile("http://050400.oss-cn-zhangjiakou.aliyuncs.com/版本.txt","sdcard/青石/版本.txt") then
		最新版本 = readFile("sdcard/青石/版本.txt")
		if 当前版本 ~=  最新版本  then
			if 0 == downloadFile("http://050400.oss-cn-zhangjiakou.aliyuncs.com/公告.txt","sdcard/青石/公告.txt") then
				公告 = readFile("sdcard/青石/公告.txt")
			else
				HUD("获取更新公告失败")
			end
			goto one
		else
			HUD("已是最新版本: "..当前版本)
			return
		end
	else
		HUD("获取更新信息失败")
		--[===[toast("获取更新信息失败",0,0,15)
		sleep(1000)]===]
		return
	end
	::one::
	function 更新()
		if 0 == downloadFile("http://050400.oss-cn-zhangjiakou.aliyuncs.com/斑驳青石.lr","sdcard/青石/斑驳青石.lr") then
			installLrPkg("sdcard/青石/斑驳青石.lr")
			HUD("更新成功!重启脚本!")
			restartScript()
		else
			HUD("下载安装包失败..")
		end
	end
	function 取消()
		ui.dismiss(标题)
	end
	动态.创建布局({名称=标题,大小={-2,-2},文字颜色=文字颜色,背景="#ff112233"})
	动态.创建文字框({布局=标题,名称="版本",文本="当前版本:"..当前版本.." | 最新版本:"..最新版本,文字颜色=文字颜色})
	动态.换行({布局=标题,名称="换行1-1"})
	动态.创建文字框({布局=标题,名称="公告",文本=公告,文字颜色=文字颜色})
	动态.换行({布局=标题,名称="换行1-2"})
	动态.创建图像控件({布局=标题,名称="取消更新",文件名="图像-取消",事件="取消()"})
	动态.创建图像控件({布局=标题,名称="更新",文件名="图像-更新",事件="更新()"})
	ui.show(标题,false)
end

功能设置界面()
提示更新()

while(true) do
	if 运行 then
		sleep(500)
		break
	elseif 关闭 then
		sleep(500)
		exitScript()
	end
end
writeLog("UI加载完成...")
